{
  "basics": {
    "name": "Haowei Wang",
    "label": "Student",
    "image": "",
    "email": "hw_wang@whu.edu.cn",
    "phone": "(86) 17396156070",
    "url": "https://haowei2000.github.io/",
    "summary": "Graduated from Wuhan University with a master's degree in the class of 2025. During the school period, he has participated in many science and innovation competitions with his classmates and won national awards; he has won national scholarships, excellent academic scholarships and other awards; he has published two C journals and a number of softwritings in his own work (in addition to his mentor); he has participated in his mentor's major social science projects and the Hubei National Energy Group cross project, and he has declared and been in charge of the Wuhan University State Secrecy Institute's 2023 independent research projects; Skill mastery level To be able to use python language, basic linux commands, mongodb database, understand third-party libraries such as pytorch, huggingface, etc., and understand natural language processing, generative artificial intelligence related content.",
    "location": {
      "address": "123 Wuhan St",
      "postalCode": "430072",
      "city": "Wuhan",
      "countryCode": "CN",
      "region": "Hubei"
    }
  },
  "education": [
    {
      "institution": "Wuhan University",
      "location": "Wuhan, China",
      "url": "https://www.whu.edu.cn/",
      "area": "Information Management and Information System",
      "studyType": "BA",
      "startDate": "2018-09-01",
      "endDate": "2022-05-01",
      "score": "3.4/4.0",
      "courses": [
        "Data Visualization",
        "Information System Analysis and Design (Experiment)",
        "Linear Algebra"
      ]
    },
    {
      "institution": "Wuhan University",
      "location": "Wuhan, China",
      "url": "https://www.whu.edu.cn/",
      "area": "Secrecy Management",
      "studyType": "BA",
      "startDate": "2022-09-01",
      "endDate": "2025-05-01",
      "score": "3.57/4.0",
      "courses": [
        "Computer Network Security",
        "Data Mining"
      ]
    }
  ],
  "awards": [
    {
      "title": "2023 National Scholarship",
      "date": "2023-11-01",
      "awarder": "China government",
      "summary": "Granted by China government for outstanding academic performance and other skills."
    },
    {
      "title": "2024 National Scholarship",
      "date": "2024-11-01",
      "awarder": "China government",
      "summary": "Granted by China government for outstanding academic performance and other skills."
    },
    {
      "title": "2023 First-Class Scholarship",
      "date": "2023-11-01",
      "awarder": "Wuhan University",
      "summary": "Granted by Wuhan University for outstanding academic performance and other skills."
    },
    {
      "title": "2024 First-Class Scholarship",
      "date": "2024-11-01",
      "awarder": "Wuhan University",
      "summary": "Granted by Wuhan University for outstanding academic performance and other skills."
    },
    {
      "title": "The 21st National Post-Graduate Mathematical Contest in Modeling, National Second Prize",
      "date": "2023-11-01",
      "awarder": "China Postgraduate Mathematical Contest in Modeling",
      "summary": "Awarded the National Second Prize in the China Postgraduate Mathematical Contest in Modeling, one of the most prestigious competitions for postgraduate students in China, requiring teamwork to solve complex real-world problems using mathematical modeling within a 72-hour timeframe. Our project is Research on Emergency Enabling of Highway Emergency Lanes Based on High Precision Simulation and Deep Learning."
    },
    {
      "title": "The 20th National Post-Graduate Mathematical Contest in Modeling, National Second Prize",
      "date": "2022-11-01",
      "awarder": "China Postgraduate Mathematical Contest in Modeling",
      "summary": "Awarded the National Second Prize in the China Postgraduate Mathematical Contest in Modeling, one of the most prestigious competitions for postgraduate students in China, requiring teamwork to solve complex real-world problems using mathematical modeling within a 72-hour timeframe. Our project is Stroke risk prediction and associated factors analysis based on multiple interpretable machine learning."
    },
    {
      "title": "The 1st China Postgraduate Fintech Innovation Competition, National Third Prize",
      "date": "2023-11-01",
      "awarder": "China Postgraduate Fintech Innovation Competition",
      "summary": "The competition focuses on the innovative application of artificial intelligence, blockchain, cloud computing, big data and other digital technologies in the financial sector. Our project is Deep Learning-based Text and Image Recognition System for Financial Fraud."
    },
    {
      "title": "The 10th China Graduate Contest on Smart-city Technology and Creative Design, National Third Prize",
      "date": "2023-11-01",
      "awarder": "China Graduate Contest on Smart-city Technology and Creative Design",
      "summary": "The competition is based on the concept of 'Creativity Inspires Wisdom, Innovation Drives Development'. And a total of 2,194 teams from within China participated, and a total of 61 teams won the second prize and above. Our project is Deep Learning-based Multi-Perspective Identity Recognition and Student Classroom Status Detection System."
    },
    {
      "title": "The 5th China Graduate AI Innovation Competition, National Third Prize",
      "date": "2023-11-01",
      "awarder": "China Graduate AI Innovation Competition",
      "summary": "The competition is based on the concept of 'AI Empowerment, Smart Leadership'. Our project is Deep Learning-based Multi-Perspective Identity Recognition and Student Classroom Status Detection System."
    }
  ],
  "publications": [
    {
      "name": "A Comparison of Generative AI-generated Content and User-generated Content in the Thematic Perspective",
      "publisher": "Information studies: Theory and Application",
      "releaseDate": "2023",
      "url": "https://doi.org/10.16353/j.cnki.1000-7490.2023.10.025",
      "summary": "This paper compares generative AI-generated content and user-generated content from a thematic perspective."
    },
    {
      "name": "Identification of ChatGPT Answers and Physician Answers in the Online Medical Community",
      "publisher": "Data Science and Informetrics",
      "releaseDate": "2023-08",
      "url": "https://dsi.hdu.edu.cn/NewsDetail.aspx?ID=196",
      "summary": "This study identifies differences between ChatGPT answers and physician answers in online medical communities."
    },
    {
      "name": "Identification Methods of Artificial Intelligence Generated Content in Online Communities",
      "publisher": "Document, Information and Knowledge",
      "releaseDate": "2024",
      "url": "https://doi.org/10.13366/j.dik.2024.02.028",
      "summary": "This paper discusses methods for identifying AI-generated content in online communities."
    },
    {
      "name": "Research on Multidimensional Hierarchical Algorithm Literacy Evaluation",
      "publisher": "Journal of Modern Information",
      "releaseDate": "2024",
      "url": "https://doi.org/10.3969/j.issn.1008-0821.2024.03.001",
      "summary": "This research evaluates algorithm literacy using a multidimensional hierarchical approach."
    },
    {
      "name": "Prediction and Analysis of Multiple Causes of Mental Health Problems Based on Machine Learning",
      "publisher": "Springer Nature Switzerland",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1007/978-3-031-57867-0_11",
      "summary": "This paper predicts and analyzes multiple causes of mental health problems using machine learning."
    },
    {
      "name": "Recognizing Implicitly Toxic Content Based on Multiple Attention Mechanisms",
      "publisher": "Proceedings of the Association for Information Science and Technology",
      "releaseDate": "2024",
      "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pra2.1127",
      "summary": "This study uses multiple attention mechanisms to recognize implicitly toxic content."
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "Intermediate",
      "icon": "fa-solid fa-code",
      "keywords": [
        "Python"
      ]
    },
    {
      "name": "Technologies",
      "level": "Intermediate",
      "icon": "fa-solid fa-cogs",
      "keywords": [
        "Linux",
        "Mongodb",
        "Pytorch"
      ]
    }
  ],
  "projects": [
    {
      "name": "RBLU (Reverse Bilingual Language Understanding)",
      "summary": "A benchmark to evaluate the reverse inference ability of large language models, which evaluates reverse inference by providing answers and requiring corresponding questions. RBLU streamlines evaluation by minimizing subjective answer standardization and is adaptable across domains.",
      "highlights": [
        "Tools Used: Python, Pytorch"
      ],
      "url": "https://github.com/haowei2000/RBLU"
    },
    {
      "name": "Traffic-Congestion-Detection",
      "summary": "Identify vehicles from real highway videos and count traffic data, build time-series models to predict traffic congestion, and intelligently investigate whether emergency lanes are open.",
      "highlights": [
        "Tools Used: Python, Autogluon"
      ],
      "url": "https://github.com/haowei2000/Traffic-Congestion-Detection"
    }
  ]
}